Autodesk.Revit.DB.Plumbing.PipeScheduleType.GetPipeScheduleId(Autodesk.Revit.DB.Document,System.String)
Returns an existing pipe schedule type with the same name.
doc:
The document
name:
The name of requested schedule type.
Returns:
Returns the element id of request schedule type, or invalidElementId if the name is not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeScheduleType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new pipe schedule type with the given name.
Remarks:
If the name is already taken by an existing schedule type, an InvalidOperationException will be thrown.
doc:
The document
name:
The name of requested schedule type.
Returns:
Returns the newly created schedule type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The name is already taken by an existing pipe schedule type.
Since:
2017

Autodesk.Revit.DB.Plumbing.PipeScheduleType
Represents a pipe schedule type in the Autodesk Revit MEP product.